<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
 <HEAD>
   <TITLE> [Meneamenet-devel] Subversion
   </TITLE>
   <LINK REL="Index" HREF="http://lists.berlios.de/pipermail/meneamenet-devel/2006-May/index.html" >
   <LINK REL="made" HREF="mailto:meneamenet-devel%40lists.berlios.de?Subject=Re%3A%20%5BMeneamenet-devel%5D%20Subversion&In-Reply-To=%3C200605081426.23694.edulix%40gmail.com%3E">
   <META NAME="robots" CONTENT="index,nofollow">
   <style type="text/css">
       pre {
           white-space: pre-wrap;       /* css-2.1, curent FF, Opera, Safari */
           }
   </style>
   <META http-equiv="Content-Type" content="text/html; charset=us-ascii">
   <LINK REL="Previous"  HREF="000018.html">
   <LINK REL="Next"  HREF="000022.html">
 </HEAD>
 <BODY BGCOLOR="#ffffff">
   <H1>[Meneamenet-devel] Subversion</H1>
    <B>Edulix</B> 
    <A HREF="mailto:meneamenet-devel%40lists.berlios.de?Subject=Re%3A%20%5BMeneamenet-devel%5D%20Subversion&In-Reply-To=%3C200605081426.23694.edulix%40gmail.com%3E"
       TITLE="[Meneamenet-devel] Subversion">edulix at gmail.com
       </A><BR>
    <I>Mon May  8 14:26:23 CEST 2006</I>
    <P><UL>
        <LI>Previous message: <A HREF="000018.html">[Meneamenet-devel] Subversion
</A></li>
        <LI>Next message: <A HREF="000022.html">[Meneamenet-devel] Subversion
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#20">[ date ]</a>
              <a href="thread.html#20">[ thread ]</a>
              <a href="subject.html#20">[ subject ]</a>
              <a href="author.html#20">[ author ]</a>
         </LI>
       </UL>
    <HR>  
<!--beginarticle-->
<PRE>El Sunday, 7 de Mayo de 2006 13:13, Javier Carranza escribi&#243;:
&gt;<i> &#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;Esto depende de c&#243;mo est&#233; configurada la plataforma gforge y el
</I>&gt;<i> acceso para los administradores a la plataforma en berlios. En cada
</I>&gt;<i> plataforma gforge se crea un repositorio subversion independiente para cada
</I>&gt;<i> proyecto. Generalmente se localizan en /svnroot y dentro de este directorio
</I>&gt;<i> se encontrar&#225;n los homes independientes del svn de cada proyecto. En cada
</I>&gt;<i> uno de esos homes, hay un directorio conf con su correspondiente fichero
</I>&gt;<i> svnserve.conf de
</I>&gt;<i> configuraci&#243;n, donde podr&#237;as establecer permisos por ramas y usuarios.
</I>
Hola lista!

Les he mandado una petici&#243;n [1] para que me permitan tener mi propio fichero 
de configuraci&#243;n y ya me han contestado, pod&#233;is ver los detalles all&#237;: 
b&#225;sicamente me han dicho que fichero tocar para poner los permisos, y con 
ello he conseguido ponerlos tal y como lo hab&#237;amos estipulado, es decir cada 
desarrollador con su propia rama que s&#243;lo puede tocar &#233;l. 

Todo esto lo escribir&#233; en la p&#225;gina de desarrollo del wiki oficial, pero por 
ahora os adelanto como ser&#225; entrar en el desarrollo: 

1. os registr&#225;is en berlios y os suscribis a esta lista de correo.
2. Mand&#225;is un correo a la lista solicitando colaborar, e indicando vuestro 
alias en berlios.
3. Alguien de los que tienen capacidad para ello os habilitar&#225; vuestra propia 
rama a la que s&#243;lo vosotros podr&#233;is mandar cambios. (Por ahora yo o gallir). 
Se os comunicar&#225; que la rama estar&#225; lista, y podre&#237;s empezar a trabajar con 
ella inmediatamente!
4. Os recomiendo a todos con rama propia o no que os suscrib&#225;is a la lista de 
cambios de subversion para estar atentos a todo lo que se menea; as&#237; se puede 
abrir el debate, si os gusta alg&#250;n parche que otro haya realizado lo pod&#233;is 
incorporar a vuestra rama, y si lo v&#233;is importante y estable, se puede 
incluir en trunk!

Me he dedicado a crear ramas a los interesados, menciono el nombre de usuario 
que es el de la rama. Estos somos por ahora:
 - ashacz
 - marcosbl
 - jdeveloper
 - trunks
 - gallir
 - edulix

Pod&#233;is empezar a enviar cambios; yo voy a ir subiendo ya el soporte de openid 
inicial, recomiendo a marcosbl que suba el parche para los marcadores 
sociales y a trunks todos sus cambios. Hacedlo poco a poco en peque&#241;as tandas 
para que sea m&#225;s manejable. Tambi&#233;n ir&#233; aplicando los que me vayan 
interesando a mi rama para ir prob&#225;ndolos y pod&#233;is hacer lo propio =)

Suerte
     Edulix.
--
[1] 
<A HREF="https://developer.berlios.de/support/?func=detailsupport&amp;group_id=1&amp;support_id=102077">https://developer.berlios.de/support/?func=detailsupport&amp;group_id=1&amp;support_id=102077</A>

</PRE>

<!--endarticle-->
    <HR>
    <P><UL>
        <!--threads-->
	<LI>Previous message: <A HREF="000018.html">[Meneamenet-devel] Subversion
</A></li>
	<LI>Next message: <A HREF="000022.html">[Meneamenet-devel] Subversion
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#20">[ date ]</a>
              <a href="thread.html#20">[ thread ]</a>
              <a href="subject.html#20">[ subject ]</a>
              <a href="author.html#20">[ author ]</a>
         </LI>
       </UL>

<hr>
<a href="https://lists.berlios.de/mailman/listinfo/meneamenet-devel">More information about the Meneamenet-devel
mailing list</a><br>
</body></html>
