<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
 <HEAD>
   <TITLE> [Meneamenet-devel] Desarrollo de meneame
   </TITLE>
   <LINK REL="Index" HREF="http://lists.berlios.de/pipermail/meneamenet-devel/2006-May/index.html" >
   <LINK REL="made" HREF="mailto:meneamenet-devel%40lists.berlios.de?Subject=Re%3A%20%5BMeneamenet-devel%5D%20Desarrollo%20de%20meneame&In-Reply-To=%3C200605040149.13172.edulix%40gmail.com%3E">
   <META NAME="robots" CONTENT="index,nofollow">
   <style type="text/css">
       pre {
           white-space: pre-wrap;       /* css-2.1, curent FF, Opera, Safari */
           }
   </style>
   <META http-equiv="Content-Type" content="text/html; charset=us-ascii">
   <LINK REL="Previous"  HREF="000000.html">
   <LINK REL="Next"  HREF="000002.html">
 </HEAD>
 <BODY BGCOLOR="#ffffff">
   <H1>[Meneamenet-devel] Desarrollo de meneame</H1>
    <B>Edulix</B> 
    <A HREF="mailto:meneamenet-devel%40lists.berlios.de?Subject=Re%3A%20%5BMeneamenet-devel%5D%20Desarrollo%20de%20meneame&In-Reply-To=%3C200605040149.13172.edulix%40gmail.com%3E"
       TITLE="[Meneamenet-devel] Desarrollo de meneame">edulix at gmail.com
       </A><BR>
    <I>Thu May  4 01:49:12 CEST 2006</I>
    <P><UL>
        <LI>Previous message: <A HREF="000000.html">[Meneamenet-devel] Correo de prueba
</A></li>
        <LI>Next message: <A HREF="000002.html">[Meneamenet-devel] Hola Mundo
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#1">[ date ]</a>
              <a href="thread.html#1">[ thread ]</a>
              <a href="subject.html#1">[ subject ]</a>
              <a href="author.html#1">[ author ]</a>
         </LI>
       </UL>
    <HR>  
<!--beginarticle-->
<PRE>&#161;A las buenas!

Como hab&#237;a prometido, ya tenemos habilitados una lista de correo y un 
repositorio subversion (entre otros) para que sirvan de platarforma de 
desarrollo del c&#243;digo fuente de men&#233;ame. 

SI he montado todo este tinglado es para reunir a los interesados en el 
desarrollo del c&#243;digo de marras para poder colaborar y mejorarlo. Contamos 
con una lista de desarrollo [1] ya funcional y un repositorio subversi&#243;n con 
una primera versi&#243;n que parte de la versi&#243;n 1.1 que me indicaste en los 
primeros correos. Y hay m&#225;s cosas, todo en la p&#225;gina principal del proyecto 
en berlios [2].

Aun falta por estipular la din&#225;mica que vayamos a seguir, pero si se le echa 
ganas no supondr&#225; ning&#250;n problema que no podamos solventar.

Una vez la gente se vaya apuntando, considero que el siguiente paso ser&#237;a dar 
acceso de escritura a subversion a aquellos ya involucrados de alguna manera, 
que hayan enviado parches y sobretodo si estos ya est&#225;n incorporados en el 
c&#243;digo.  

El objetivo es que los cambios que desde aqu&#237; se realicen vayan entrando en 
la &quot;rama de ricardo&quot;, que es la que termina ejecut&#225;ndose en el servidor web 
de meneame.net y la que se considera por tanto oficial.

Hasta ahora el m&#233;todo para realizar cambios a la rama oficial era contactar 
con Ricardo por email adjuntando un parche al mensaje. Este parche ser&#237;a 
posteriormente analizado y puesto a la cola seg&#250;n su prioridad. Si el parche 
ten&#237;a buen aspecto, terminaba teste&#225;ndose de forma directa en el servidor de 
meneame.net completa o parcialmente si as&#237; Galli consideraba oportuno.

Espero que desde este nuevo sitio podamos liberar a Ricardo un poco de la 
carga de tener que analizar los parches que desarroll&#233;is, envi&#225;ndolos a la 
lista, discuti&#233;ndolos, prob&#225;ndolos, subi&#233;ndolos al svn y arreglando fallos 
propios y ajenos, aprovech&#225;ndonos de las herramientas de que disponemos. 
Seguramente todos los cambios que acaben en el repositorio no terminen en la 
rama de Ricardo, pero ese deber&#237;a ser el objetivo.

Tengo mis dudas sobre cual ser&#237;a la forma mas conveniente de conseguirlo. Una 
posibilidad a considerar ser&#237;a el siguiente ciclo: cada 3 o 4 semanas parar 
de aceptar nuevas aportaciones y congelar trunk, la rama principal. Durante 
el tiempo que sea necesario, una semana o dos en principio, dedicarnos a 
pulir este c&#243;digo, mientras que Ricardo va a&#241;adiendo poco a poco los cambios 
ya bien testeados poco a poco a meneame.net. 

Nada de esto ser&#237;a posible sin esas personas que menean el software libre a lo 
largo y ancho de la red. Os animo a que si hab&#233;is le&#237;do aunque sea s&#243;lo parte 
de este mensaje, opin&#233;is, expong&#225;is vuestras proposiciones y contribuy&#225;is al 
di&#225;logo siempre de forma respetuosa y constructiva. Para ello basta que os 
suscrib&#225;is a la lista desde [1].  

A Ricardo y aquellos que quieran escribir en el repositorio, primero ten&#233;is 
que registrar en berlios, y luego enviar un mensaje con vuestro nombre de 
usuario a esta lista de correo una vez suscritos.

Gracias por vuestro tiempo,
                Eduardo Robles Elvira.

--
[1] <A HREF="http://lists.berlios.de/mailman/listinfo/meneamenet-devel">http://lists.berlios.de/mailman/listinfo/meneamenet-devel</A>
[2] <A HREF="https://developer.berlios.de/projects/meneamenet/">https://developer.berlios.de/projects/meneamenet/</A>

</PRE>

<!--endarticle-->
    <HR>
    <P><UL>
        <!--threads-->
	<LI>Previous message: <A HREF="000000.html">[Meneamenet-devel] Correo de prueba
</A></li>
	<LI>Next message: <A HREF="000002.html">[Meneamenet-devel] Hola Mundo
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#1">[ date ]</a>
              <a href="thread.html#1">[ thread ]</a>
              <a href="subject.html#1">[ subject ]</a>
              <a href="author.html#1">[ author ]</a>
         </LI>
       </UL>

<hr>
<a href="https://lists.berlios.de/mailman/listinfo/meneamenet-devel">More information about the Meneamenet-devel
mailing list</a><br>
</body></html>
